---
kind: enumMember
id: F:Autodesk.Revit.DB.ElementTypeGroup.ViewTypeFloorPlan
enum: Autodesk.Revit.DB.ElementTypeGroup
source: html/f5b57d98-c551-9693-9009-8eb17fef8a14.htm
---
# Autodesk.Revit.DB.ElementTypeGroup.ViewTypeFloorPlan

The floor plan view type.